Revit 2027 API
ContourSetting.GetItemIndex Method
 Get the index of a contour setting item of the current contour setting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetItemIndex(
	ContourSettingItem item
)
Public Function GetItemIndex (
	item As ContourSettingItem
) As Integer
public:
int GetItemIndex(
	ContourSettingItem^ item
)
member GetItemIndex :
        item : ContourSettingItem -> int
Parameters
item ContourSettingItem
 The contour setting item.
Return Value
Int32
 The index of the input contour setting item. -1 if the item is not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ContourSetting Class
Autodesk.Revit.DB Namespace